OpenFOAM-v2506/tutorials/combustion/reactingFoam/RAS/SandiaD_LTS/0.orig/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wallTube
    {
        type            zeroGradient;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    inletPilot
    {
        type            fixedValue;
        value           uniform 0;
    }

    inletAir
    {
        type            fixedValue;
        value           uniform 0;
    }

    wallOutside
    {
        type            zeroGradient;
    }

    inletCH4
    {
        type            fixedValue;
        value           uniform 0;
    }

    frontAndBack_pos
    {
        type            wedge;
    }

    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
